app/controllers/admin/developer_controller.rb

INSERT INTO `developers` (`name`, `created_at`, `updated_at`) VALUES ('Creamsoft', '2018-03-20 11:53:10', '2018-03-20 11:53:10')
---
  def create
    @developer = Developer.new(developer_params)
    if @developer.save

SELECT  `developers`.* FROM `developers` WHERE `developers`.`id` = 1 LIMIT 1
---
  def edit
    @developer = Developer.find(params[:id])

SELECT  `developers`.* FROM `developers` WHERE `developers`.`id` = 1 LIMIT 1
UPDATE `developers` SET `name` = 'Cream', `updated_at` = '2018-03-20 11:52:40' WHERE `developers`.`id` = 1
---
  def update
    @developer = Developer.find(params[:id])
    if @developer.update_attributes(developer_params)

SELECT  `developers`.* FROM `developers` WHERE `developers`.`id` = 2 LIMIT 1
DELETE FROM `developers` WHERE `developers`.`id` = 2
---
  def destroy
    @developer = Developer.find(params[:id])
    @developer.destroy

SELECT  `developers`.* FROM `developers` WHERE `developers`.`id` = 1 LIMIT 1
---
  def show
    @developer = Developer.find(params[:id])

SELECT `developers`.* FROM `developers`
---
  def index
    @developers = Developer.all