app/controllers/admin/order_controller.rb

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 9 LIMIT 1
---
  def close
    order = Order.find(params[:id])

SELECT  `orders`.* FROM `orders` WHERE (status = 'closed') LIMIT 10 OFFSET 0
---
  def index
    @status = params[:id]
    if @status.blank?
      @status = 'all'
      conditions = nil
    else
      conditions = "status = '#{@status}'"
    end
    @orders = Order.where(conditions).paginate(:page => params[:page], :per_page => 10)