app/controllers/admin/program_controller.rb

INSERT INTO `programs` (`name`, `kind`, `developer_id`, `serial_number`, `blurb`, `price`, `cover_image_file_name`, `cover_image_content_type`, `cover_image_file_size`, `cover_image_updated_at`, `developed_at`, `created_at`, `updated_at`) VALUES ('hola', 'una cosa', 1, '123', 'Prueba de una cosa', 12.0, 'prueba-01-ketF-U2131796188083t-575x323_El_Correo.jpg', 'image/jpeg', 25123, '2018-04-20 19:27:35', '2018-04-20 19:27:00', '2018-04-20 19:27:35', '2018-04-20 19:27:35')
---
  def create
    @program = Program.new(program_params)
    if @program.save

SELECT  `programs`.* FROM `programs` WHERE `programs`.`id` = 2 LIMIT 1
---
  def edit
    load_data
    @program = Program.find(params[:id])

SELECT  `programs`.* FROM `programs` WHERE `programs`.`id` = 2 LIMIT 1
UPDATE `programs` SET `serial_number` = '54321', `blurb` = 'Llama a tus familiares', `price` = 87.0, `developed_at` = '2016-04-21 09:45:00', `updated_at` = '2018-04-21 09:50:25' WHERE `programs`.`id` = 3
---
  def update
    @program = Program.find(params[:id])
    if @program.update_attributes(program_params)

SELECT  `programs`.* FROM `programs` WHERE `programs`.`id` = 1 LIMIT 1
DELETE FROM `programs` WHERE `programs`.`id` = 1
---
  def destroy
    @program = Program.find(params[:id])
    @program.destroy

SELECT  `programs`.* FROM `programs` WHERE `programs`.`id` = 2 LIMIT 1
---
  def show
    @program = Program.find(params[:id])

SELECT  `programs`.* FROM `programs`  ORDER BY serial_number LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `programs`
---
  def index
    sort_by = params[:sort_by]
    @programs = Program.order(sort_by).paginate(:page => params[:page], :per_page => 5)

SELECT `developers`.* FROM `developers`
SELECT `suppliers`.* FROM `suppliers`
---
    def load_data
      @developers = Developer.all
      @suppliers = Supplier.all