app/controllers/admin/supplier_controller.rb

  def create
    @supplier = Supplier.new(supplier_params)
    if @supplier.save
---
INSERT INTO `suppliers` (`first_name`, `last_name`, `created_at`, `updated_at`) VALUES ('Juan', 'Garcia', '2018-04-10 10:59:11', '2018-04-10 10:59:11')

  def edit
    @supplier = Supplier.find(params[:id])
---
SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 2 LIMIT 1

  def update
    @supplier = Supplier.find(params[:id])
    if @supplier.update_attributes(supplier_params)
---
SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 2 LIMIT 1
UPDATE `suppliers` SET `first_name` = 'Antonio', `updated_at` = '2018-04-10 11:07:34' WHERE `suppliers`.`id` = 2

  def destroy
    @supplier = Supplier.find(params[:id])
    @supplier.destroy
---
SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 2 LIMIT 1
DELETE FROM `suppliers` WHERE `suppliers`.`id` = 2

  def show
    @supplier = Supplier.find(params[:id])
---
SELECT  `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` = 2 LIMIT 1

  def index
    @suppliers = Supplier.all
---
SELECT `suppliers`.* FROM `suppliers`