app/views/admin/program/_form.html.erb

  <p><label for="program[supplier_ids][]">Suppliers</label><br/>
  <%= select_tag 'program[supplier_ids][]', options_from_collection_for_select(@suppliers, :id, :first_name,
      @program.suppliers.collect{|supplier| supplier.id}), { :multiple => true, :size => 5 } %></p>
---
SELECT `suppliers`.* FROM `suppliers` INNER JOIN `programs_suppliers` ON `suppliers`.`id` = `programs_suppliers`.`supplier_id` WHERE `programs_suppliers`.`program_id` = 2