app/controllers/cart_controller.rb

SELECT  `programs`.* FROM `programs` WHERE `programs`.`id` = 3 LIMIT 1
---
  def add
    @program = Program.find params[:id]

SELECT  `programs`.* FROM `programs` WHERE `programs`.`id` = 3 LIMIT 1
---
  def remove
    @program = Program.find params[:id]

DELETE FROM `cart_items` WHERE `cart_items`.`id` = 2
---
  def clear
    @page_title = 'Vaciar carrito'
    if request.post?
      @cart.cart_items.destroy_all