app/controllers/catalog_controller.rb

SELECT  `programs`.* FROM `programs` WHERE `programs`.`id` = 7 LIMIT 1
---
  def show
    @program = Program.find(params[:id])

SELECT  `programs`.* FROM `programs`  ORDER BY programs.id desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `programs`
SELECT `developers`.* FROM `developers` WHERE `developers`.`id` IN (3, 4, 1, 2)
SELECT `suppliers`.* FROM `suppliers` WHERE `suppliers`.`id` IN (2, 3, 4, 1, 5)
---
  def index
    @programs = Program.order("programs.id desc").includes(:developer, :suppliers).paginate(:page => params[:page], :per_page => 5)