app/controllers/checkout_controller.rb

SELECT  1 AS one FROM `programs` INNER JOIN `cart_items` ON `programs`.`id` = `cart_items`.`program_id` WHERE `cart_items`.`cart_id` = 1 LIMIT 1
---
  def index
    @order = Order.new
    @page_title = 'Checkout'
    if @cart.programs.empty?

SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1
INSERT INTO `orders` (`email`, `phone_number`, `ship_to_first_name`, `ship_to_last_name`, `ship_to_address`, `ship_to_city`, `ship_to_postal_code`, `ship_to_country_code`, `customer_ip`, `status`, `created_at`, `updated_at`) VALUES ('davidminybboy@gmail.com', '616562398', 'David', 'Naran', 'ndwqjl', 'San Fernando', '11100', 'ES', '127.0.0.1', 'open', '2018-05-11 13:36:35', '2018-05-11 13:36:35')
DELETE FROM `cart_items` WHERE `cart_items`.`id` = 5
---
  def submit_order
    @cart = Cart.find(params[:cart][:id]) # Search the cart from the cart id hidden field of the form
    @order = Order.new(order_params)
    @order.ship_to_country_code = @order.ship_to_country_code.upcase
    @order.customer_ip = request.remote_ip
    @order.status = 'open'
    @page_title = 'Checkout'
    populate_order

    if @order.save
      if @order.process
        flash[:notice] = 'Su pedido ha sido realizado y se procesará inmediatamente.'
        session[:order_id] = @order.id
        @cart.cart_items.destroy_all # empty shopping cart