app/controllers/user_controller.rb

SELECT COUNT(*) FROM `users`
---
  def new
    @user = User.new
    @page_title = 'Create new account'
    if current_user
      flash[:notice] = 'Only one account can be created.'
      redirect_to :controller => 'about', :action => 'index'
    else
      # only when there are no accounts it allows to create a new one, unique in the system
      redirect_to :controller => 'user_session', :action => 'new' unless User.count == 0

INSERT INTO `users` (`name`, `login`, `email`, `password_salt`, `crypted_password`, `persistence_token`, `perishable_token`, `login_count`, `current_login_at`, `current_login_ip`, `last_request_at`, `created_at`, `updated_at`) VALUES ('admin', 'admin', 'admin@hotmail.com', 'eMr9O8C9ug3xVt3APPsm', '400$8$18$364c5ef860713f0f$3979328f4503fb9dd69920f4a78397a9e2aec92b0365829045142a3f741b0758', '425c22625f57ffb676431021a7cc9fcae79353687900c9560f73f6bd7092dfe20a9f5594ccf4d13f50f8cd657d62d794365fec9b408f23c1bba89eb842eeffdf', 'QDaSm9Cjk0FpIiuj0uqo', 1, '2018-05-15 10:36:50', '127.0.0.1', '2018-05-15 10:36:50', '2018-05-15 10:36:50', '2018-05-15 10:36:50')
---
  def create
    @user = User.new(user_params)
    if @user.save # the new user has been logged in automatically

UPDATE `users` SET `name` = 'Admin', `password_salt` = 'FD7cJHykWMOdJPJEJpLB', `crypted_password` = '400$8$2e$a9452ff17b2047bb$8d6828ebebcae4df75ae1afb03fcc41a3df607689d9a396ec57020723c1296e9', `persistence_token` = '6bda8982cf6e04f99203ea17d7c227e6b297f5ce964097a8e85647ffdf3fe81e0eb071e9866ad4798b125716d34433ad81e89caa29d14b1a57220f6223f45294', `perishable_token` = 'IoGtdGyMneJfP1rNZXD', `last_request_at` = '2018-05-15 10:43:08', `login_count` = 2, `last_login_at` = '2018-05-15 10:36:50', `current_login_at` = '2018-05-15 10:43:08', `last_login_ip` = '127.0.0.1', `updated_at` = '2018-05-15 10:43:08' WHERE `users`.`id` = 1
---
  def update
    @user = current_user
    if @user.update_attributes(user_params)